Failed test with Bad file descriptors
1c1
< fd 42 (-1) '(null)'
---
> fd 42 (0) END-OF-FILE
Failed test with Bad file descriptors
1c1
< fd 7777777 (-1) '(null)'
---
> fd 7777777 (0) END-OF-FILE
Failed test with Bad file descriptors
1,2c1,2
< fd 3 (-1) '(null)'
< fd 2147483647 (-1) '(null)'
---
> fd 3 (0) END-OF-FILE
> fd 2147483647 (0) END-OF-FILE
7c7
< fd 44 (-1) '(null)'
---
> fd 44 (0) END-OF-FILE
20c20
< fd 1000 (-1) '(null)'
---
> fd 1000 (0) END-OF-FILE
Failed test with Multiple file descriptors
33,34c33
< fd 8 (0) END-OF-FILE
< fd 9 (0) END-OF-FILE
---
> fd 8 (-1) '(null)'
35a35
> fd 9 (-1) '(null)'
